---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArray.Size
source: html/91be7b3c-ccd9-400a-9791-1bac6faba8ec.htm
---
# Autodesk.Revit.DB.ModelCurveArray.Size Property

Returns the number of model curves that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```